In [3]:
import pandas as pd

In [21]:
# creating dataframe

data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Tom','eshan','aman','ram'],
    'Age': [28, 24, 35, 32, 40,33,44,55],
    'City': ['New York', 'Paris', 'Berlin', 'Tokyo', 'Tokyo','city1','city1','city3']
}
df = pd.DataFrame(data)

In [22]:
df.loc[0,'Name']
df.iloc[0,1]

np.int64(28)

In [23]:
df.describe()

             Age
count   8.000000
mean   36.375000
std     9.811618
min    24.000000
25%    31.000000
50%    34.000000
75%    41.000000
max    55.000000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   City    8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [27]:
df.groupby('City')['Age'].min()

City
Berlin      35
New York    28
Paris       24
Tokyo       32
city1       33
city3       55
Name: Age, dtype: int64

In [20]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda', 'Tom', 'John', 'Anna', 'Peter'],
    'City': ['New York', 'Paris', 'Berlin', 'London', 'Tokyo', 'New York', 'Paris', 'Berlin'],
    'Sales': [100, 200, 300, 400, 500, 100, 200, 300]
}
 
df = pd.DataFrame(data)
 

df.groupby('City')['Sales'].sum()

City
Berlin      600
London      400
New York    200
Paris       400
Tokyo       500
Name: Sales, dtype: int64